Jinzuu/wc_ws/ub_lib/stm32_ub_ws2812.c
  if(nr<ws2812_maxanz) {
    ws2812_ptr[nr]=rgb_col;
        
    if(refresh==1) UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette auf eine Farbe setzen (RGB)
// rgb_col : Farbwert (in RGB)
// refresh : 0=ohne refresh, 1=mit refresh
//--------------------------------------------------------------
void UB_WS2812_All_Led_RGB(WS2812_RGB_t rgb_col, uint8_t refresh)
{
  uint32_t n;

  if(ws2812_channel==0) return;

  for(n=0;n<ws2812_maxanz;n++) {
    ws2812_ptr[n]=rgb_col;
  }
  if(refresh==1) UB_WS2812_Refresh();
}


//--------------------------------------------------------------
// eine LED der aktiven WS2812-Kette auf eine Farbe setzen (HSV)
// nr      : [0...WS2812_LED_ANZ-1]
// hsv_col : Farbwert (in HSV)
// refresh : 0=ohne refresh, 1=mit refresh
//--------------------------------------------------------------
void UB_WS2812_One_Led_HSV(uint32_t nr, WS2812_HSV_t hsv_col, uint8_t refresh)
{
  WS2812_RGB_t rgb_col;

  if(ws2812_channel==0) return;

  if(nr<ws2812_maxanz) {
    // farbe in RGB umwandeln
    UB_WS2812_RGB_2_HSV(hsv_col, &rgb_col);
    ws2812_ptr[nr]=rgb_col;
        
    if(refresh==1) UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette auf eine Farbe setzen (HSV)
// hsv_col : Farbwert (in HSV)
// refresh : 0=ohne refresh, 1=mit refresh
//--------------------------------------------------------------
void UB_WS2812_All_Led_HSV(WS2812_HSV_t hsv_col, uint8_t refresh)
{
  uint32_t n;
  WS2812_RGB_t rgb_col;

  if(ws2812_channel==0) return;

  // farbe in RGB umwandeln
  UB_WS2812_RGB_2_HSV(hsv_col, &rgb_col);
  for(n=0;n<ws2812_maxanz;n++) {
    ws2812_ptr[n]=rgb_col;
  }
  if(refresh==1) UB_WS2812_Refresh();
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette eine position nach links schieben
// letzte LED wird ausgeschaltet
//--------------------------------------------------------------
void UB_WS2812_Shift_Left(void)
{
  uint32_t n;

  if(ws2812_channel==0) return;

  if(ws2812_maxanz>1) {
    for(n=1;n<ws2812_maxanz;n++) {
      ws2812_ptr[n-1]=ws2812_ptr[n];
    }
    ws2812_ptr[n-1]=WS2812_RGB_COL_OFF;
 
    UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette eine position nach rechts schieben
// erste LED wird ausgeschaltet
//--------------------------------------------------------------
void UB_WS2812_Shift_Right(void)
{
  uint32_t n;

  if(ws2812_channel==0) return;

  if(ws2812_maxanz>1) {
    for(n=ws2812_maxanz-1;n>0;n--) {
      ws2812_ptr[n]=ws2812_ptr[n-1];
    }
    ws2812_ptr[n]=WS2812_RGB_COL_OFF;

    UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette eine position nach links rotieren
// letzte LED bekommt den Farbwert der ersten LED
//--------------------------------------------------------------
void UB_WS2812_Rotate_Left(void)
{
  uint32_t n;
  WS2812_RGB_t d;

  if(ws2812_channel==0) return;

  if(ws2812_maxanz>1) {
    d=ws2812_ptr[0];
    for(n=1;n<ws2812_maxanz;n++) {
      ws2812_ptr[n-1]=ws2812_ptr[n];
    }
    ws2812_ptr[n-1]=d;

    UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// alle LEDs der aktiven WS2812-Kette eine position nach rechts rotieren
// erste LED bekommt den Farbwert der letzten LED
//--------------------------------------------------------------
void UB_WS2812_Rotate_Right(void)
{
  uint32_t n;
  WS2812_RGB_t d;

  if(ws2812_channel==0) return;

  if(ws2812_maxanz>1) {
    d=ws2812_ptr[ws2812_maxanz-1];
    for(n=ws2812_maxanz-1;n>0;n--) {
      ws2812_ptr[n]=ws2812_ptr[n-1];
    }
    ws2812_ptr[n]=d;

    UB_WS2812_Refresh();
  }
}


//--------------------------------------------------------------
// interne Funktion
// loescht alle WS2812-Ketten
//--------------------------------------------------------------
void p_WS2812_clearAll(void)
{
  //-------------------------
  // einmal DMA starten
  // (ohne Signal, Dauer LoPegel)
  //-------------------------
  if(WS2812_LED_CH4_ANZ>0) {
    // auf Kanal 4 schalten
    UB_WS2812_SetChannel(4);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  }
  if(WS2812_LED_CH3_ANZ>0) {
    // auf Kanal 3 schalten
    UB_WS2812_SetChannel(3);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  }
  if(WS2812_LED_CH2_ANZ>0) {
    // auf Kanal 2 schalten
    UB_WS2812_SetChannel(2);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  }
  if(WS2812_LED_CH1_ANZ>0) {
    // auf Kanal 1 schalten
    UB_WS2812_SetChannel(1);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  }

  //-------------------------
  // alle LEDs ausschalten
  //-------------------------
  if(WS2812_LED_CH4_ANZ>0) {
    // auf Kanal 4 schalten
    UB_WS2812_SetChannel(4);
    UB_WS2812_All_Led_RGB(WS2812_RGB_COL_OFF,1);
  }
  if(WS2812_LED_CH3_ANZ>0) {
    // auf Kanal 3 schalten
    UB_WS2812_SetChannel(3);
    UB_WS2812_All_Led_RGB(WS2812_RGB_COL_OFF,1);
  }
  if(WS2812_LED_CH2_ANZ>0) {
    // auf Kanal 2 schalten
    UB_WS2812_SetChannel(2);
    UB_WS2812_All_Led_RGB(WS2812_RGB_COL_OFF,1);
  }
  if(WS2812_LED_CH1_ANZ>0) {
    // auf Kanal 1 schalten
    UB_WS2812_SetChannel(1);
    UB_WS2812_All_Led_RGB(WS2812_RGB_COL_OFF,1);
  }
}


//--------------------------------------------------------------
// interne Funktion
// errechnet aus den RGB-Farbwerten der aktiven LEDs
// die notwendigen PWM-Werte fuer die Datenleitung
//--------------------------------------------------------------
void p_WS2812_calcTimerBuf(void)
{
  uint32_t n;
  uint32_t pos;
  WS2812_RGB_t led;

